GREET_RESPONSES = [
    "Здравствуйте!",
    "Добрый день!",
    "Привет!",
    "Рад вас видеть!",
    "И вам не хворать)"
]

BYE_RESPONSES = [
    "До скорых встреч!",
    "Пока!",
    "Если что, я всегда тут",
    "Увидимся!",
    "До скорого",
    "Чао-какао!"
]

SMALLTALK_RESPONSES = [
    "Прикольно",
    "Супер",
    "Прекрасно",
    "Отлично",
    "Круто!",
    "Неплохо"
]

HOBBY_QUESTIONS = [
    "Есть ли у тебя хобби? Какое?",
    "Чем увлекаешься?",
    "Какие у тебя увлечения?"
]

FAILURE_RESPONSES = [
    "Не совсем понял вас(",
    "Я ещё только учусь, сформулируйте иначе(",
    "Слишком сложно для меня, извините, не понимаю(",
    "Я пока не знаю, как на такое ответить("
]