GREET_RESPONSES = [
    "Здравствуйте!",
    "Добрый день!",
    "Привет!",
    "Рад вас видеть!"
]

BYE_RESPONSES = [
    "До скорых встреч!",
    "Пока!",
    "Если что, я всегда тут",
    "Увидимся!",
    "До скорого",
    "Чао-какао!"
]

SMALLTALK_RESPONSES = [
    "Нормально",
    "Всё супер",
    "Прекрасно",
    "Отлично"
]

HOBBY_QUESTIONS = [
    "Есть ли у тебя хобби? Какое?",
    "Чем увлекаешься?",
    "Какие у тебя увлечения?"
]

NO_HOBBY_PATTERNS = [
    "нет хобби",
    "ничем",
    "не увлекаюсь",
    "нет увлечений",
    "не знаю",
    "ничего",
    "хз",
    "неа",
    "нет",
    "никаких"
]

FAILURE_RESPONSES = [
    "Не совсем понял вас(",
    "Я ещё только учусь, сформулируйте иначе(",
    "Слишком сложно для меня, извините, не понимаю(",
    "Я пока не знаю, как на такое ответить("
]