HOBBIES = {

    "games": {
        "keywords": [
            "игр",
            "играю",
            "геймер",
            "гама",
            "steam",
            "dota",
            "cs",
            "minecraft",
            "катк",
            "ката"
        ],

        "ad_message":
            "Игры занимают много места\n "
            "Хороший SSD позволит быстрее загружать их, а большой объём позволит "
            "хранить больше игр и не удалять старые ради новых"
    },

    "photo": {
        "keywords": [
            "фото",
            "фотограф",
            "сним",
            "съём",
            "фотк"
        ],

        "ad_message":
            "Фотографии быстро накапливаются и забивают всю память\n"
            "Надёжный накопитель поможет хранить их безопасно"
    },

    "video": {
        "keywords": [
            "видео",
            "монтаж",
            "монтир",
            "видеомонтаж",
            "premiere",
            "davinci",
            "capcut"
        ],

        "ad_message":
            "Видео могут занимать десятки гигабайт\n"
            "Для них особенно важен вместительный диск"
    },

    "music": {
        "keywords": [
            "музык",
            "музыкант",
            "гитара",
            "фортепиано",
            "пианино",
            "fl",
            "cubase",
            "reaper",
            "бит",
            "песн",
            "рэп",
            "рок",
            "поп",
            "джаз",
            "запис"
        ],

        "ad_message":
            "Большие музыкальные коллекции и проекты тоже "
            "требуют места для хранения на устройстве"
    },

    "art": {
        "keywords": [
            "рисов",
            "рису",
            "арт",
            "art",
            "3d",
            "3д",
            "изобра",
            "живопис",
            "краск",
            "график",
            "дизайн",
            "design",
            "ретушь",
            "adobe",
            "photoshop",
            "illustrat",
            "sai",
            "corel"
        ],

        "ad_message":
            "Работа с изображениями требует места для программ и проектов: "
            "один только, например, Photoshop требует от 10 Гб свободного места"
    },

    "coding": {
        "keywords": [
            "программир",
            "пишу програм",
            "делаю програм",
            "пишу код",
            "код",
            "разраб",
            "python",
            "c",
            "java",
            "golang",
            "linux",
            "хак"
        ],
        "ad_message":
            "Работа с кодом требует высокой скорости доступа\n"
            "Быстрый и вместительный SSD - мастхэв для такого, как вы"
    },

    "no_hobby": {
        "keywords": [
            "нет хобби",
            "ничем",
            "не увлекаюсь",
            "нет увлечений",
            "не знаю",
            "не думаю",
            "ничего",
            "хз",
            "неа",
            "нет",
            "никаких",
            "вряд ли",
            "врядли"
        ],

        "ad_message":
            "Уверен, вам приходится хранить много фотографий, документов или видео\n"
            "Чтобы не волноваться, сколько ещё осталось свободного места, "
            "не помешает вместительный накопитель"
    }
}

USE_CASE_MAPPING = {
    "games": "games",
    "video": "video",
    "photo": "archive",
    "music": "archive",
    "art": "archive",
    "coding": "system",
    "no_hobby": "archive"
}

USE_CASE_PRIORITIES = {

    "games": {
        "preferred_type": "SSD",
        "speed_weight": 3,
        "size_weight": 2,
        "price_weight": 1
    },

    "video": {
        "preferred_type": "SSD",
        "speed_weight": 2,
        "size_weight": 3,
        "price_weight": 1
    },

    "archive": {
        "preferred_type": "HDD",
        "speed_weight": 0,
        "size_weight": 3,
        "price_weight": 2
    },

    "system": {
        "preferred_type": "SSD",
        "speed_weight": 3,
        "size_weight": 1,
        "price_weight": 2
    }
}